# Xây dựng model và lưu model

In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier

## 1. Load data và xử lý dữ liệu

In [2]:
data=pd.read_csv('data/titanic.csv',index_col=0)
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 1 to 1309
Data columns (total 12 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  home.dest  745 non-null    object
dtypes: float64(2), int64(4), object(6)
memory usage: 132.9+ KB

In [3]:
data=data.interpolate()
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 1 to 1309
Data columns (total 12 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1309 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  home.dest  745 non-null    object
dtypes: float64(2), int64(4), object(6)
memory usage: 132.9+ KB

In [4]:
data=data.drop(['cabin','home.dest'],axis=1)
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 1 to 1309
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   survived  1309 non-null   int64
 2   name      1309 non-null   object
 3   sex       1309 non-null   object
 4   age       1309 non-null   float64
 5   sibsp     1309 non-null   int64
 6   parch     1309 non-null   int64
 7   ticket    1309 non-null   object
 8   fare      1309 non-null   float64
 9   embarked  1307 non-null   object
dtypes: float64(2), int64(4), object(4)
memory usage: 112.5+ KB

In [5]:
data=data.dropna()
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1307 entries, 1 to 1309
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1307 non-null   int64
 1   survived  1307 non-null   int64
 2   name      1307 non-null   object
 3   sex       1307 non-null   object
 4   age       1307 non-null   float64
 5   sibsp     1307 non-null   int64
 6   parch     1307 non-null   int64
 7   ticket    1307 non-null   object
 8   fare      1307 non-null   float64
 9   embarked  1307 non-null   object
dtypes: float64(2), int64(4), object(4)
memory usage: 112.3+ KB

In [6]:
data=pd.get_dummies(data,columns=['sex','embarked'],drop_first=True)
data.head()

,pclass,survived,name,age,sibsp,parch,ticket,fare,sex_male,embarked_Q,embarked_S
1,1,1,"Allen, Miss. Elisabeth Walton",29.0000,0,0,24160,211.3375,0,0,1
2,1,1,"Allison, Master. Hudson Trevor",0.9167,1,2,113781,151.5500,1,0,1
3,1,0,"Allison, Miss. Helen Loraine",2.0000,1,2,113781,151.5500,0,0,1
4,1,0,"Allison, Mr. Hudson Joshua Creighton",30.0000,1,2,113781,151.5500,1,0,1
5,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",25.0000,1,2,113781,151.5500,0,0,1

In [7]:
data=data[['pclass','sex_male','age',
           'sibsp','parch','fare',
           'embarked_Q','embarked_S','survived']]
data.head()

,pclass,sex_male,age,sibsp,parch,fare,embarked_Q,embarked_S,survived
1,1,0,29.0000,0,0,211.3375,0,1,1
2,1,1,0.9167,1,2,151.5500,0,1,1
3,1,0,2.0000,1,2,151.5500,0,1,0
4,1,1,30.0000,1,2,151.5500,0,1,0
5,1,0,25.0000,1,2,151.5500,0,1,0

## 2. Build model

In [8]:
data.survived.value_counts()

0    809
1    498
Name: survived, dtype: int64

In [9]:
from sklearn.utils import resample
data_0=data[data.survived==0]
data_1=data[data.survived==1]

data_1_re=resample(data_1,n_samples=data_0.shape[0],replace=True)
data_new=pd.concat([data_1_re,data_0])

In [10]:
X=data_new.drop('survived',axis=1) #features
y=data_new.survived

In [11]:
X_train,X_test,y_train,y_test=train_test_split(X,y)

model=RandomForestClassifier()
model.fit(X_train,y_train)

model.score(X_train,y_train),model.score(X_test,y_test)

(0.9884583676834295, 0.8518518518518519)

In [12]:
import pickle as pk
with open('titanic_model.pkl','wb') as f:
    pk.dump(model,f)